app/controllers/channels_controller.rb

SELECT "channels".* FROM "channels"
---
  def index
    @channels = Channel.all

INSERT INTO "channels" ("channel_name", "created_at", "description", "updated_at") VALUES (?, ?, ?, ?)  [["channel_name", "Dogs"], ["created_at", Mon, 17 Jun 2013 20:13:38 UTC +00:00], ["description", "pictures of cats"], ["updated_at", Mon, 17 Jun 2013 20:13:38 UTC +00:00]]
---
  def create
    @channel = Channel.new(channel_params)
    @channel.user = current_user
    @channel.save

SELECT "channels".* FROM "channels" WHERE "channels"."id" = ? ORDER BY "channels"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_channel
      @channel = Channel.find(params[:id])