app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.save
---
INSERT INTO "comments" ("content", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "this is first comment!"], ["created_at", Tue, 18 Jun 2013 14:18:58 UTC +00:00], ["post_id", 4], ["updated_at", Tue, 18 Jun 2013 14:18:58 UTC +00:00]]