app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:comment][:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 10]]