app/controllers/posts_controller.rb

SELECT "channels".* FROM "channels" WHERE "channels"."id" = ? ORDER BY "channels"."id" ASC LIMIT 1  [["id", 2]]
INSERT INTO "posts" ("caption", "created_at", "img_url", "updated_at") VALUES (?, ?, ?, ?)  [["caption", "a picture"], ["created_at", Mon, 17 Jun 2013 20:56:43 UTC +00:00], ["img_url", "pic.jpg"], ["updated_at", Mon, 17 Jun 2013 20:56:43 UTC +00:00]]
---
  def create
    @channel = Channel.find(params[:post][:channel_id])
    if @channel.visible_to?(current_user) || Collaboration.where(channel: @channel, user: current_user).present?
      @post = Post.create(post_params)