app/controllers/users_controller.rb

  def index
     @users = User.order(:username).where("username like ?", "%#{params[:term]}%")
     render json: @users.map(&:username)
---
SELECT "users".* FROM "users"